Revit 2024 API
IFCFileReadOptions.FileName Property
 The full file name of the IFC file to be read.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public string FileName { get; set; }
Visual Basic
Public Property FileName As String
	Get
	Set
Visual C++
public:
property String^ FileName {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
IFCFileReadOptions Class
Autodesk.Revit.DB.IFC Namespace